class MorseDecoder:
    codes = {
        "._": "A",
        "_...": "B",
        "_._.": "C",
        "_..": "D",
        ".": "E",
        ".._.": "F",
        "__.": "G",
        "....": "H",
        "..": "I",
        ".___": "J",
        "_._": "K",
        "._..": "L",
        "__": "M",
        "_.": "N",
        "___": "O",
        ".__.": "P",
        "__._": "Q",
        "._.": "R",
        "...": "S",
        "_": "T",
        ".._": "U",
        "..._": "V",
        ".__": "W",
        "_.._": "X",
        "_.__": "Y",
        "__..": "Z",
    }

    def decode(self, cipher):
        """
        Функция декодирует шифр
        :param cipher: str шифр морзе
        :return: str полученное слово
        """

        # TODO: Реализовать функциюddd